#brew analytics off

# Shell
brew "zsh"
brew "zoxide"

# Core utils
brew "bat"
brew "eza"
brew "fd"
brew "fzf"
brew "git"
brew "ripgrep"
brew "stow"
brew "unzip"

# System info
brew "fastfetch"

# Editor
brew "neovim"
brew "lazygit"
brew "python"

# Terminal multiplexer
brew "tmux"

# Fonts (macOS only — harmless to include on Linux, brew will skip cask)
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
